[
    {
        "name": "Nashua Durban",
        "years": "1997 - 2000",
        "image": "assets/miscImages/Nashua.jpg",
        "description": "From 1997 to 2000, I had the privilege of working as a workshop technician at an office automation company. Drawing on my experience in catering, where I honed exceptional customer relation skills, I seamlessly transitioned into servicing, repairing, and refurbishing office equipment. During this time, I witnessed the evolution from analogue copiers to cutting-edge digital multifunction machines. My responsibilities included conducting repairs on customers' faulty equipment, refurbishing older devices for resale, and even contributing to firmware changes during the Y2K panic. This role not only allowed me to showcase my technical expertise but also highlighted my adaptability in a rapidly changing technological landscape.",
        "resonsibilities": [
            {
                "task": "Doing repairs to customers faulty equipment."
            },
            {
                "task": "Refurbishing old equipment for resale."
            },
            {
                "task": "Keeping up with increasingly digital devices"
            }
        ]
    },
    {
        "name": "Picture Perfect Durban",
        "years": "2000 - 2001",
        "image": "assets/miscImages/PPDurban.jpg",
        "description": "During my tenure at Picture Perfect Durban from 2000 to 2001, I was part of an innovative digital photographic studio that embraced cutting-edge technology, including the latest 3MP camera systems. My role involved providing crucial technical support during photoshoots, assisting in studio setup, and engaging in consultations with clients to ensure their vision was realized. Following the shoots, I meticulously handled desktop production, utilizing Apple computers and Adobe Photoshop for editing, and printed the final images on a dye sublimation printer. My training from Spector in Johannesburg further enhanced my skills, enabling me to deliver high-quality results and maintain stringent quality control standards throughout the production process. This experience not only deepened my expertise in digital imaging but also sharpened my eye for detail and client satisfaction.",
        "resonsibilities": [
            {
                "task": "Desktop production for photo shoots."
            },
            {
                "task": "Assisted with studio setup."
            },
            {
                "task": "Consulted with clients."
            },
            {
                "task": "Quality control."
            }
        ]
    },
    {
        "name": "SAGEM SA",
        "years": "2001 - 2002",
        "image": "assets/miscImages/Sagem.png",
        "description": "From 2001 to 2002, I was based in Kwara State, Nigeria, serving as a State Technical Coordinator for SAGEM SA during a large-scale project to digitize the country's ID document system. In this role, I was responsible for recruiting a team of 670 local staff members, providing comprehensive training on portable enrollment equipment, and managing the project's implementation across the state. My duties also included ensuring that all 49 enrollment stations were operational in time for the project's launch. This experience honed my leadership and project management skills, as I effectively coordinated a significant team and successfully delivered a critical national project in a challenging and dynamic environment.",
        "resonsibilities": [
            {
                "task": "Recruit local staff"
            },
            {
                "task": "Train the recruited staff."
            },
            {
                "task": "Managed a project across Kwara state."
            }
        ]
    },
    {
        "name": "SEIKO TERAOKA",
        "years": "2002 - 2005",
        "image": "assets/miscImages/teraoka.png",
        "description": "From 2002 to 2005, I had the opportunity to work at SEIKO TERAOKA, where I played a pivotal role in calibrating and certifying weighing equipment. Armed with an SABS qualification as an instruments technician, I traveled extensively across remote areas in the province to ensure the accuracy and reliability of various weighing instruments. Additionally, I actively contributed to the development of connectivity solutions, enhancing the efficiency and functionality of the equipment. My responsibilities also included the seamless installation of modern measurement technologies, further showcasing my technical expertise and commitment to precision in every aspect of my work. This experience not only solidified my proficiency in instrumentation but also underscored my dedication to delivering top-notch service in challenging environments.",
        "resonsibilities": [
            {
                "task": "Calibrated and certified weighing equipment."
            },
            {
                "task": "Assisted with development of connectivity solutions."
            },
            {
                "task": "Installations of modern measurement technologies."
            }
        ]
    },
    {
        "name": "Ethekwini Municipality",
        "years": "2005 - 2010",
        "image": "assets/miscImages/Ethekwini_CoA.png",
        "description": "During my tenure at Ethekwini Municipality from 2005 to 2010, I made significant contributions to various projects, including the installation of a cutting-edge emergency communications centre at the Moses Mbida Stadium and the deployment of public desktop computer workstations in several dozen libraries across the city. In addition to these notable projects, I also trained two interns to prepare them for the A+ certification, furthering their IT career prospects. My responsibilities also included maintaining the current IT infrastructure and providing end-user support, ensuring the smooth operation of the municipality's IT systems. To further enhance the municipality's IT capabilities, I ran a small IT workshop at the city hall, fostering a culture of continuous learning and development. This experience not only solidified my project management and IT skills but also demonstrated my commitment to nurturing and empowering the next generation of IT professionals.",
        "resonsibilities": [
            {
                "task": "Managed a number of projects."
            },
            {
                "task": "Trained interns."
            },
            {
                "task": "Maintained the current I.T. infrustructure."
            },
            {
                "task": "Supported end users."
            }
        ]
    },
    {
        "name": "Infinite Property Management",
        "years": "2010 - 2015",
        "image": "assets/miscImages/IPM.jpeg",
        "description": "From 2010 to 2015, I served as a property manager at Infinite Property Management, where I successfully managed close to 40 sectional titles in accordance with the national Sectional Titles Act. This role encompassed a paralegal component, ensuring that all aspects of the function adhered to the act. I developed and presented annual budgets for the upkeep and financial obligations of each property at the Annual General Meetings (AGMs), ensuring clear communication and understanding with all homeowners in the apartment buildings or complexes. My responsibilities also included maintaining close communication with the Bodies Corporate Trustees or shareholders to keep expenses as close to the budget as possible. Additionally, I organized and managed maintenance projects by coordinating with contractors and other stakeholders, demonstrating my strong project management skills. Furthermore, I performed various management functions such as mediating internal disputes and maintaining regular communication with homeowners and tenants, ensuring a harmonious living environment for all residents. This experience not only honed my property management skills but also showcased my ability to manage complex projects and maintain strong relationships with various stakeholders.",
        "resonsibilities": [
            {
                "task": "Managed close to 40 sectional titles."
            },
            {
                "task": "Ensured that the sectional titles act is observed and adhered to."
            },
            {
                "task": "Created budgets and chaired AGM meetings for the budgets."
            },
            {
                "task": "Managed a large number of maintainance projects."
            },
            {
                "task": "Regularly communicated with all the stakeholders."
            }
        ]
    }
]